Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: སངས་རྒྱས་སྤོབས་པ་མཐའ་ཡས་ཏོག་སྐྱེ་བའི། །ཡུལ་ནི་ཡུལ་འཁོར་ཁ་ལོ་སྒྱུར་ཞེས་བྱ། །
en: “The buddha Ananta­pratibhāna­ketu Will be born in a place called Leader of the Land.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་ཡབ་ནི་ཡོན་ཏན་དོན། །དོན་ལྡན་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend one hundred leagues. “Meaningful Qualities will be his father, and Endowed with Meaning will be this victor’s mother.

source: སྲས་པོ་བདེན་བྱིན་ལེགས་འབྱོར་རིམ་གྲོ་པ། །
en: Truth Gift will be his son and Excellent Wealth his attendant.

source: མཐོང་དགའ་ཞེས་ནི་བྱ་བ་མཁས་པ་སྟེ། །
en: Delightful Sight will be the scholar

source: བཀོད་པ་གསལ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Luminous Array the one of miracles.

source: འདུས་པ་ལན་གྲངས་མཐའ་ཡས་ཀུན་ལ་ཡང་། །བྱང་ཆུབ་མཆོག་ལ་ངེས་པར་གྱུར་པ་པོ། །དེ་དག་ཐམས་ཅད་བྱེ་བ་དཔག་ཏུ་མེད། །
en: “There will be infinite congregations, Each of them gathering innumerable millions Of those certain to attain supreme awakening.

source: བདེ་བར་གཤེགས་པ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་བདུན་འབུམ་བར་དུ་གནས། །
en: “And after this well-gone one has attained nirvāṇa His sacred Dharma will remain for seven hundred thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །རིན་ཆེན་བདུན་པོ་དག་ཀྱང་འབྱུང་བར་འགྱུར། །
en: His relics will be abundant And accompanied by the seven precious substances.

source: དེ་བཞིན་གཤེགས་པ་བརྟུལ་ཞུགས་བསྟར་བ་ཡི། །སྐྱེ་ཡུལ་བསམ་པ་བཞིན་དུ་སྦྱིན་ཞེས་བྱ། །
en: “The thus-gone Vratanidhi Will be born in a place called Wish-Fulfilling.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱད་བརྒྱ་ཡབ་ནི་ཡོན་ཏན་འོད། །དགའ་བའི་འོད་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend eight hundred leagues. “Shining Qualities will be his father, and Light of Joy will be this victor’s mother.

source: སྲས་པོ་བྲམ་ཟེ་རབ་སྡུག་རིམ་གྲོ་པ། །
en: Brahmin will be his son and Endearing his attendant.

source: གླང་པོའི་སྟབས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Elephant Character will be the scholar

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་གཉིས་ཀུན་ལའང་། །གཡོ་མེད་ཡིད་ལྡན་ལེགས་པར་གནས་པ་པོ། །དེ་དག་ཐེར་འབུམ་ཕྲག་ནི་བཅུ་བཅུ་ཡོད། །
en: “There will be sixty-two consecutive congregations, Each of them gathering ten billion Who abide auspiciously with immutable minds.

source: ཡོངས་སུ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་བདུན་ཁྲི་བདུན་སྟོང་བར་དུ་གནས། །
en: “And when this teacher has attained parinirvāṇa His sacred Dharma will remain for seventy-seven thousand years.

source: སྐུ་གདུང་མཆོད་རྟེན་དཔག་ཚད་ལྔ་པ་གཅིག །ནོར་བུ་རིན་ཆེན་ལྡ་ལྡི་སྟོང་གིས་སྤྲས། །
en: His relics will reside in a single stūpa Five leagues large and decorated with tassels of precious jewels.

source: མཚུངས་པ་མེད་པའི་མཆོད་པའི་གནས་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་ཡུལ་འཁོར་མཆོག་ཅེས་བྱ། །
en: “The incomparable Pūjya Will be born in a place called Supreme Land.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་ལྔ་བརྒྱ་ཡབ་ནི་ཏོག་བཟངས་ཡིན། །བྱས་པ་གདོན་མི་ཟ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend five hundred leagues. “Excellent Crest will be his father, and Indubitable Deeds will be this victor’s mother.

source: སྲས་པོ་སྐལ་བཟང་ཐུབ་དཀའ་རིམ་གྲོ་པ། །
en: Excellent Fortune will be his son and Hard to Conquer his attendant.

source: ཡུལ་དུ་རྣམ་པར་གྲགས་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Famed throughout the Land the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་ཀུན་ལ་ཡང་། །ཞི་བ་མི་སློབ་འབྲས་ལ་མངོན་དགའ་བ། །བྱེ་བ་ཕྲག་ནི་སུམ་ཅུ་གཉིས་གཉིས་ཡོད། །
en: “There will be sixty consecutive congregations, Each of them gathering three hundred twenty million Who delight in the fruition of serenity beyond training.

source: རྒྱལ་བའི་མཆོད་རྟེན་དཔག་ཚད་བཅུ་གཉིས་པ། །རིན་ཆེན་བརྒྱ་ཡི་ལྡ་ལྡིས་མཛེས་པར་བྱས། །
en: The relics of this victor will reside in a single stūpa Twelve leagues large and decorated with jewel tassels.

source: དེ་བཞིན་གཤེགས་པ་མྱ་ངན་རྒལ་བ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་རྟག་པར་དགའ་ཞེས་བྱ། །
en: “The thus-gone Uttīrṇaśoka Will be born in a place called Constant Joy.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །དགུ་བཅུ་རྩ་གཉིས་དྲང་སྲོང་ཆེན་པོ་ཡབ། །དོན་གྱི་འགྲོས་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be kṣatriya, And his light will extend ninety-two leagues. “Great Sage will be his father, and Ultimate Mode will be this victor’s mother.

source: སྲས་པོ་ལྷ་མིན་ལྷ་ནི་རིམ་གྲོ་པ། །
en: Demigod will be his son and Deity his attendant.

source: གྲགས་པའི་ཏོག་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Crest of Fame will be the scholar

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་གཉིས་ཀུན་ལའང་། །ལྷ་ཡི་གནས་པའི་ཕ་མཐར་ཕྱིན་པ་པོ། །བྱེ་བ་ཕྲག་ནི་སུམ་ཅུ་གཉིས་གཉིས་ཡོད། །
en: “There will be thirty-two consecutive congregations, Each of them gathering three hundred twenty million Who have gone beyond the realms of the gods.

source: དངོས་པོ་མེད་པར་ཕྱིན་པའི་དམ་ཆོས་དག །ལོ་གྲངས་སུམ་ཁྲི་བཞི་སྟོང་བར་དུ་གནས། །
en: “And the sacred Dharma of the one gone beyond entities Will remain for thirty-four thousand years.

source: རྒྱལ་བ་ཡོངས་སུ་མྱ་ངན་འདས་ནས་ཀྱང་། །ཐུགས་རྗེ་ཆེན་པོའི་སྐུ་གདུང་རྒྱས་པར་འགྱུར། །
en: When this victorious one has attained parinirvāṇa The relics of his great compassion will be abundant.

source: དེ་བཞིན་གཤེགས་པ་དགེ་བ་དགྱེས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་ཡིད་འོང་དགའ་ཞེས་བྱ། །
en: “The thus-gone Kṣemapriya Will be born in a place called Delightful Joy.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་ཡབ་ནི་བརྟུལ་ཞུགས་དོན། །དགེ་བའི་བློ་གྲོས་ཞེས་བྱ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend one hundred leagues. “True Yogic Discipline will be his father, and Virtuous Intelligence will be this victor’s mother.

source: སྲས་པོ་ལྟ་བྱེད་ཚངས་བྱིན་རིམ་གྲོ་པ། །
en: Eye will be his son and Brahmā Gift his attendant.

source: སེང་གེའི་ང་རོ་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: Lion’s Roar will be the scholar

source: འབྲུག་སྒྲ་སྒྲོགས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Dragon Voice the one of miracles.

source: འདུས་པ་ལན་གྲངས་དགུ་བཅུ་ཀུན་ལ་ཡང་། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་དགུ་དགུ་དང་། །གཞན་ཡང་ས་ཡ་ཕྲག་ནི་དྲུག་དྲུག་ཡོད། །
en: “There will be ninety consecutive congregations, Each of them gathering nine hundred ninety million, As well as six million others.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་དཔག་ཚད་ནི། །ལྔ་པ་གཅིག་སྟེ་རིན་ཆེན་བདུན་ལས་བྱས། །
en: The stūpa with the relics of this victor Will be five leagues large and made of the seven precious substances.

source: དེ་བཞིན་གཤེགས་པ་འགྲོ་བའི་བློ་གྲོས་ཀྱི། །སྐྱེ་བའི་ཡུལ་ནི་ལྷ་ཡི་འོད་ཅེས་བྱ། །
en: “The thus-gone Jagadmati Will be born in a place called Divine Light.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཏུ་མེད་དོ་ཤིན་ཏུ་བྱང་ཆུབ་ཡབ། །ཆོས་ཀྱི་དབང་ཕྱུག་མ་ནི་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will have unfathomable reach. “Complete Awakening will be his father, and Lady Who Masters the Dharma will be this victor’s mother.

source: སྲས་པོ་མཆོད་པ་སྐར་མཁན་རིམ་གྲོ་པ། །
en: Worship will be his son and Astrologer his attendant.

source: དཔག་མེད་འོད་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Fathomless Light will be the scholar

source: དོན་ཡོད་མཐའ་ཡས་པ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Infinite Presence of Meaning the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་གཉིས་ཀུན་ལའང་། །འཇིག་རྟེན་ཆོས་བརྒྱད་དག་དང་བྲལ་བ་པོ། །བྱེ་བ་ཕྲག་ནི་སྟོང་ཕྲག་བཅུ་བཅུ་ཡོད། །
en: “There will be eighty-two consecutive congregations, Each of them gathering one hundred billion Who are free from the eight worldly concerns.

source: མྱ་ངན་འདས་པ་དེ་ཡི་དམ་ཆོས་དག །ལོ་གྲངས་བརྒྱད་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And when this teacher has attained nirvāṇa His sacred Dharma will also remain for eighty thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་བདུན་པ་ཁོར་ཡུག་བླ་རེར་ལྡན། །
en: The relics of this victor will reside in a single stūpa Seven leagues large and covered by canopies.

source: དེ་བཞིན་གཤེགས་པ་དགྱེས་པར་གཤེགས་པ་ཡི། །སྐྱེ་ཡུལ་རིན་ཆེན་མཆོག་ཏུ་གནས་ཞེས་བྱ། །
en: “The thus-gone Priyaṅgama Will be born in a place called Perfect Presence of Jewels.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་སྟོང་ཡོད་ཡབ་ནི་གྲོགས་བཟང་ཡིན། །བྱམས་མཆོག་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend one thousand leagues. “Excellent Companion will be his father, and Supreme Love will be this victor’s mother.

source: སྲས་པོ་མཆོད་པ་ལེགས་དབང་རིམ་གྲོ་པ། །
en: Worship will be his son and Excellent Ruler his attendant.

source: བློ་གྲོས་གསལ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Clear Intelligence will be the scholar

source: མཐོང་བ་བརྩེགས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Towering Sight the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་གཉིས་ཀུན་ལའང་། །གཏི་མུག་མེད་པའི་ཕ་མཐར་ཕྱིན་འཕགས་པ། །བྱེ་བ་ཕྲག་ནི་དྲུག་ཅུ་གསུམ་གསུམ་ཡོད། །
en: “There will be sixty-two consecutive congregations, Each of them gathering six hundred thirty million noble ones Who have reached perfect freedom from dullness.

source: གྲགས་པ་མཐའ་ཡས་པ་ཡི་དམ་ཆོས་དག །ལོ་གྲངས་བརྒྱད་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And the sacred Dharma of this teacher of infinite fame Will remain for eighty thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །ཁམས་གསུམ་མཆོད་རྟེན་བཟང་པོས་གང་བར་འགྱུར། །
en: The relics of this victor will be abundant, And the three realms filled with fine stūpas.

source: དེ་བཞིན་གཤེགས་པ་ཞབས་མཛེས་སྐྱེ་བ་ཡི། །ཡུལ་ནི་འཇིག་རྟེན་སྒྲོན་མ་ཞེས་ཀྱང་བྱ། །
en: “The thus-gone Caraṇābhijñāta Will be born in a place called Lamp of the World.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་ཡབ་ནི་སྤོས་བཟངས་ཡིན། །སྤོས་མཆོག་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend one hundred leagues. “Excellent Fragrance will be his father, and Supreme Fragrance will be this victor’s mother.

source: སྲས་པོ་སྤོས་བཟངས་མེ་ཏོག་རིམ་གྲོ་པ། །
en: Excellent Fragrance will be his son and Flower his attendant.

source: ལེགས་བསྒྲུབས་གྲགས་པ་ཞེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And Renowned for Excellence in Practice the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །རི་ཡི་རྒྱལ་པོ་ལྟ་བུར་མི་གཡོ་བ། །བྱེ་བ་ཕྲག་ནི་ཁྲི་ཕྲག་བཅུ་བཅུ་ཡོད། །
en: “There will be eighty consecutive congregations, Each of them gathering one trillion Who are unshakable like the king of mountains.

source: འཇིག་རྟེན་མགོན་པོ་ཨུད་པལ་སྐྱེ་བ་ཡི། །ཡུལ་ནི་མེ་ཏོག་ཕུང་པོ་ཞེས་ཀྱང་བྱ། །
en: “The protector of the world, Utpala, Will be born in a place called Heap of Flowers.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །བྱེ་བ་མཐའ་ཡས་ཡབ་ནི་ཕན་འདོད་ཡིན། །ཟླ་བའི་འགྲོས་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be kṣatriya, And his light will extend innumerable millions of leagues. “Wish to Benefit will be his father, and Moon Orbit will be this victor’s mother.

source: སྲས་པོ་ཁ་སྒྱུར་ཏོག་ལྡན་རིམ་གྲོ་པ། །
en: Leader will be his son and Crest Possessor his attendant.

source: བདེན་པར་སྨྲ་བའི་དབྱངས་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Melody of the Teaching of the Truth the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་ཀུན་ལ་ཡང་། །འཇིག་རྟེན་མི་ཁོམ་ཆོས་ལས་གྲོལ་བ་པོ། །བྱེ་བ་ཕྲག་ནི་དྲུག་ཅུ་དྲུག་ཅུ་ཡོད། །
en: “There will be sixty consecutive congregations, Each of them gathering six hundred million Who are free from the world’s inopportune states.

source: རྒྱལ་བའི་མཆོད་རྟེན་དཔག་ཚད་བཅུ་པ་སྟེ། །གསེར་གྱི་རྒྱལ་མཚན་སྟོང་གིས་འཁོར་བར་བསྐོར། །
en: The stūpa of this victor will be ten leagues large And surrounded by a thousand golden banners.

source: དེ་བཞིན་གཤེགས་པ་དུལ་གནས་མེ་ཏོག་གི། །སྐྱེ་ཡུལ་རིན་ཆེན་སྒྲོན་མ་ཞེས་ཀྱང་བྱ། །
en: “The thus-gone Puṣpa­dama­sthita Will be born in a place called Jewel Lamp.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །བདུན་ཅུ་རྩ་གསུམ་ཡབ་ནི་ཟླ་བཟང་ཡིན། །པད་མའི་འོད་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend seventy-three leagues. “Excellent Moon will be his father, and Lotus Light will be this victor’s mother.

source: སྲས་པོ་སེང་གེ་འབྱོར་པ་རིམ་གྲོ་པ། །
en: Lion will be his son and Wealth his attendant.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་ལྔ་ཀུན་ལའང་། །རྣམ་ཐར་བརྒྱད་ཐོབ་པ་ཡི་བསམ་གཏན་པ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་བཞི་བཞི་ཡོད། །
en: “There will be sixty-five consecutive congregations, Each of them gathering seven hundred forty million Meditators who have attained the eight liberations.

source: དེ་ཡི་དམ་ཆོས་ལོ་གྲངས་བརྒྱད་ཁྲིར་གནས། །
en: “His sacred Dharma will remain for eighty thousand years.

source: སྐུ་གདུང་མཆོད་རྟེན་དཔག་ཚད་བཅུ་གསུམ་པ། །གཅིག་ཏུ་ཟད་དེ་རིན་ཆེན་མཆོག་མ་ཡི། །དྲ་བ་དག་གིས་རྣམ་པར་སྤྲས་པར་འགྱུར། །
en: The relics of this victor Will reside in a single stūpa thirteen leagues large And decorated with jewel nets.

source: བདེ་གཤེགས་སྤོབས་པ་མཐའ་ཡས་འོད་ཟེར་གྱི། །སྐྱེ་ཡུལ་སེང་གེ་རྣམ་པར་བསྒྱིངས་ཞེས་བྱ། །
en: “The well-gone Ananta­pratibhāna­raśmi Will be born in a place called Striding Lion.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་སྟོང་ཡོད་བདག་ཉིད་ཆེན་པོ་ཡབ། །བརྟུལ་ཞུགས་དྲག་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend one thousand leagues. “Great Being will be his father, and Fierce Yogic Discipline will be this victor’s mother.

source: སྲས་པོ་ཐར་དགའ་ཡོན་ཏན་རིམ་གྲོ་པ། །
en: Joy of Liberation will be his son and Qualities his attendant.

source: དགའ་མཆོག་ཅེས་ནི་བྱ་བ་མཁས་པ་སྟེ། །
en: Supreme Joy will be the scholar

source: རིན་ཆེན་གསལ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Luminous Jewel the one of miracles.

source: འདུས་པ་ལན་གྲངས་ལྔ་བཅུ་ཀུན་ལ་ཡང་། །སེང་གེ་ལྟ་བུའི་འཇིགས་པ་མེད་ཐོབ་པ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་རེ་རེ་ཡོད། །
en: “There will be fifty consecutive congregations, Each of them gathering two hundred million Who have attained lion-like fearlessness.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །ཁམས་གསུམ་རིན་པོ་ཆེ་ཡིས་གང་བར་འགྱུར། །
en: The relics of this victor will be abundant, And the three realms filled with jewels.

source: དེ་བཞིན་གཤེགས་པ་དྲང་སྲོང་གསལ་བ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་འཕགས་པས་བསྔགས་ཞེས་བྱ། །
en: “The thus-gone Ṛṣiprasanna Will be born in a place called Praised by the Noble.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བདུན་སྟོང་ཡབ་ནི་སྒྲོན་མ་ཡིན། །ལྷ་ཡི་རྒྱལ་མཚན་ཞེས་བྱ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend seven thousand leagues. “Lamp will be his father, and Divine Banner will be this victor’s mother.

source: སྲས་པོ་མཐུ་རྩལ་རབ་རྩལ་རིམ་གྲོ་པ། །
en: Power will be his son and Great Power his attendant.

source: དགྲ་བཅོམ་པ་ཡིས་བསྟོད་པ་མཁས་པ་སྟེ། །
en: Praised by the Worthy will be the scholar

source: བཀོད་པ་གནས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Enduring Array the one of miracles.

source: འདུས་པ་ལན་གྲངས་ཉི་ཤུ་གཉིས་ཀུན་ལའང་། །སྲིད་པའི་ཀུན་ལས་རྒལ་བའི་ཡིད་ལྡན་པ། །བྱེ་བ་སྟོང་ཕྲག་སུམ་ཅུ་གཉིས་གཉིས་ཡོད། །
en: “There will be twenty-two consecutive congregations, Each of them gathering three hundred twenty billion Whose minds have gone completely beyond existence.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །ཞིང་རྣམས་ཀུན་དུ་མཆོད་རྟེན་དག་གིས་གང་། །
en: The relics of this victor will be abundant, And all realms will be filled with stūpas.

source: སངས་རྒྱས་ཡོན་ཏན་བརྩོན་འགྲུས་སྐྱེ་བ་ཡི། །ཡུལ་ནི་ཡོན་ཏན་རིན་ཆེན་འཕྲོ་ཞེས་བྱ། །
en: “The buddha Guṇavīrya Will be born in a place called Radiant Jewel Qualities.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་སུམ་སྟོང་ཡབ་ནི་ལེགས་ཞི་ཡིན། །ཕན་པར་སེམས་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family of this victor will be kṣatriya And his light will extend three thousand leagues. “Excellent Peace will be his father, and Benevolent Mind will be this victor’s mother.

source: སྲས་པོ་སྒོམ་བྱེད་རབ་ཞི་རིམ་གྲོ་པ། །
en: Meditator will be his son and Thoroughly Peaceful his attendant.

source: པད་མའི་འོད་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Lotus Light will be the scholar

source: བཀོད་པ་མཛེས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Array of Beauty the one of miracles.

source: འདུས་པ་ལན་གྲངས་དགུ་བཅུ་ཀུན་ལ་ཡང་། །དགྲ་དག་ཆོམས་པ་དེ་དག་འདུས་པའི་གྲངས། །འབུམ་ཕྲག་དགུ་བཅུ་རྩ་ནི་དགུ་དགུ་ཡོད། །
en: “There will be ninety consecutive congregations, Each of them gathering Nine million nine hundred thousand worthy ones.

source: དམ་པའི་ཆོས་དག་ལོ་གྲངས་སྟོང་ཕྲག་ནི། །དགུ་བཅུ་རྩ་བརྒྱད་བར་དུ་གནས་པར་འགྱུར། །
en: “And the sacred Dharma will remain For ninety-eight thousand years.

source: རྒྱལ་བའི་མཆོད་རྟེན་དཔག་ཚད་བཅུ་གསུམ་པ། །བཻ་དཱུརྱ་ཡི་རྒྱལ་མཚན་དག་གིས་བསྐོར། །
en: The stūpa of this victor will be thirteen leagues large And surrounded by standards of beryl.

source: འཇིག་རྟེན་མགོན་པོ་སྙིང་པོ་སྐྱེ་བ་ཡི། །ཡུལ་ནི་མཐུ་རྩལ་བློ་གྲོས་ཞེས་ཀྱང་བྱ། །
en: “The protector of the world, Sāra, Will be born in a place called Powerful Intelligence.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་དགུ་ཡོད་ཡབ་ནི་ཚངས་འོད་ཡིན། །ཞི་བའི་འོད་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend nine leagues. “Brahmā Light will be his father, and Light of Peace will be this victor’s mother.

source: སྲས་པོ་སྤྲིན་ལྡན་ལག་འགྲོ་རིམ་གྲོ་པ། །
en: Cloud Bearer will be his son and Hand Movement his attendant.

source: བདུད་རྩིའི་འབྱུང་གནས་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: Source of Nectar will be the scholar

source: རྣམ་སྨིན་སྣ་ཚོགས་པ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Diverse Ripening the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་བཞི་བཞི་དང་། །གཞན་ཡང་འབུམ་ཕྲག་བཅུ་དྲུག་བཅུ་དྲུག་ཡོད། །
en: “There will be eighty consecutive congregations, Each of them gathering nine hundred forty million, Along with one million six hundred thousand others.

source: ཆགས་པ་མེད་པར་ཕྱིན་པའི་དམ་ཆོས་དག །ལོ་གྲངས་བརྒྱད་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And the sacred Dharma of the one gone beyond attachment Will also remain for eighty thousand years.

source: དེ་བཞིན་གཤེགས་པ་ལྷ་ཡི་བདག་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་འཇིག་རྟེན་གསལ་ཞེས་བྱ། །
en: “The thus-gone Marudadhipa Will be born in a place called Luminous World.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །སྟོང་གསུམ་ཙམ་ཡོད་ཡབ་ནི་ལྷ་བཟང་ཡིན། །ལྷ་ཡི་ཟླ་བ་ཞེས་བྱ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend as far as the trichiliocosm. “Divine Excellence will be his father, and Divine Moon will be this victor’s mother.

source: སྲས་པོ་ལྷ་ཡིན་ཀུན་རྒྱལ་རིམ་གྲོ་པ། །
en: Deity will be his son and Universal Victor his attendant.

source: ཡེ་ཤེས་སྟོབས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Strength of Wisdom will be the scholar

source: འདུས་པ་ལན་གྲངས་མཐའ་ཡས་ཀུན་ལ་ཡང་། །ཐམས་ཅད་བྱང་ཆུབ་དག་ལས་མི་ལྡོག་པ། །བྱེ་བ་ཕྲག་ནི་ཁྲི་ཕྲག་བརྒྱ་བརྒྱ་ཡོད། །
en: “There will be infinite congregations, Each of them gathering ten trillion Irreversible bodhisattvas.

source: བྱང་ཆུབ་ཏུ་ནི་ཡོངས་སུ་སྨིན་བྱའི་ཕྱིར། །དམ་ཆོས་ལོ་གྲངས་བྱེ་བ་བཅུ་གཉིས་གནས། །
en: “And for the sake ripening beings toward awakening The sacred Dharma will remain for one hundred twenty million years.

source: སྐུ་གདུང་རྒྱས་འགྱུར་མཆོད་རྟེན་བཟང་པོ་ཀུན། །བྱེ་བ་ཕྲག་ནི་ཁྲི་ཕྲག་གསུམ་ཞིག་འབྱུང་། །
en: His relics will be abundant, And there will appear three hundred billion stūpas.

source: དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་མཐོན་པོ་ཡི། །སྐྱེ་ཡུལ་མཐོང་ན་དགའ་བར་བྱེད་ཅེས་བྱ། །
en: “The thus-gone Uccaratna Will be born in a place called Delightful to Behold.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་འབུམ་ཡོད་ཡབ་ནི་བློ་གྲོས་ཅན། །མི་ཡི་དབང་ཕྱུག་མ་ནི་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend one hundred thousand leagues. “Intelligent will be his father, and Ruler of Humanity will be this victor’s mother.

source: སྲས་པོ་ལེགས་མཐོང་རྒྱལ་རིགས་རིམ་གྲོ་པ། །
en: Excellent Sight will be his son and Royalty his attendant.

source: རྣམ་པར་གྲགས་པར་གནས་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Enduring Fame the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་བརྒྱད་ཀུན་ལའང་། །ཉོན་མོངས་བག་ཆགས་དྲི་ལས་གྲོལ་བ་པོ། །ཐེར་འབུམ་ཕྲག་ནི་དྲུག་ཅུ་དྲུག་ཅུ་ཡོད། །
en: “There will be sixty-eight consecutive congregations, Each of them gathering sixty billion Who are free from the imprints of defilement.

source: མི་ཚེ་ལོ་གྲངས་དྲུག་ཁྲི་ལྔ་སྟོང་ཡིན། །
en: The lifespan of humans will be sixty-five thousand years,

source: དམ་པའི་ཆོས་དག་ལོ་གྲངས་སྟོང་ཕྲག་ནི། །དྲུག་ཅུ་རྩ་ལྔའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And the sacred Dharma will also remain For sixty-five thousand years.

source: སྐུ་གདུང་མཆོད་རྟེན་དཔག་ཚད་བརྒྱ་པ་གཅིག །རིན་ཆེན་པད་མ་དག་གིས་འཁོར་བར་བསྐོར། །
en: The stūpa containing his relics will be one hundred leagues large And surrounded by jewel lotuses.

source: དེ་བཞིན་གཤེགས་པ་གསལ་བ་སྐྱེ་བ་ཡི། །ཡུལ་ནི་ལྷ་རྣམས་དད་པར་བྱེད་ཅེས་བྱ། །
en: “The thus-gone Prasanna Will be born in a place called Instilling Faith in the Gods.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །སུམ་ཅུ་རྩ་གཅིག་ཡབ་ནི་མཐུ་རྩལ་ཡིན། །
en: His family will be kṣatriya, And his light will extend thirty-one leagues.

source: ཟླ་བའི་འོད་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “Power will be his father, and Moonlight will be this victor’s mother.

source: སྲས་པོ་འཇིགས་མེད་ཆགས་མེད་རིམ་གྲོ་པ། །
en: Fearless will be his son and Detached his attendant.

source: རླུང་ལྟར་འགྲོ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Moving like the Wind will be the scholar

source: ཐེ་ཙོམ་རྣམ་པར་གྲོལ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Freedom from Doubt the one of miracles.

source: འདུས་པ་ལན་གྲངས་ཉི་ཤུ་བཞི་ཀུན་ལའང་། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་གཉིས་གཉིས་དང་། །གཞན་ཡང་བྱེ་བ་འབུམ་ཕྲག་ལྔ་ལྔ་ཡོད། །
en: “There will be twenty-four consecutive congregations, Each of them gathering two hundred twenty million, Along with five trillion others.

source: དེ་བཞིན་གཤེགས་པ་སྐལ་ལྡན་ཤིང་རྟ་ཅན། །སྐྱེ་ཡུལ་བདེན་ལ་དད་པར་བྱེད་ཅེས་བྱ། །
en: “The thus-gone Bhāgīratha Will be born in a place called Instilling Faith in the Truth.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་གནས་པའི་དབང་པོ་ཡབ། །འཕགས་པའི་དོན་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be kṣatriya, And his light will extend one hundred leagues. “Enduring Ruler will be his father, and Objective of the Noble will be this victor’s mother.

source: སྲས་པོ་དད་བྱེད་དཔའ་བོ་རིམ་གྲོ་པ། །
en: Instiller of Faith will be his son and Hero his attendant.

source: འབྱོར་པར་གནས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Enriched Existence the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་གཉིས་ཀུན་ལའང་། །དགྲ་བཅོམ་ཐམས་ཅད་ཟག་པ་ཟད་པ་པོ། །ཐེར་འབུམ་ཕྲག་ནི་ལྔ་ལྔ་འདུས་པར་འགྱུར། །
en: “There will be sixty-two consecutive congregations, Each of them gathering five billion worthy ones Who have exhausted the contaminants.

source: མྱ་ངན་འདས་པར་ཕྱིན་པའི་དམ་ཆོས་དག །ལོ་གྲངས་དྲུག་ཁྲི་དྲུག་སྟོང་བར་དུ་གནས། །
en: “And the sacred Dharma of the one who attained nirvāṇa Will also remain for sixty-six thousand years.

source: སྐུ་གདུང་མཆོད་རྟེན་དཔག་ཚད་གསུམ་པ་གཅིག །གསེར་གྱི་རྒྱལ་མཚན་དག་གིས་འཁོར་བར་བསྐོར། །
en: His relics will reside in a single stūpa Three leagues large and surrounded by golden banners.

source: སེམས་ཅན་སྙིང་པོ་བསོད་ནམས་བློ་གྲོས་ཀྱི། །སྐྱེ་ཡུལ་ལྷ་རྣམས་དད་པར་བྱེད་ཅེས་བྱ། །
en: “The heart of sentient beings, Puṇyamati, Will be born in a place called Instilling Faith in the Gods.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་ཐེར་འབུམ་ཡབ་ནི་ཕན་འདོད་ཡིན། །འཕགས་ལས་ཉན་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be kṣatriya, And his light will extend one billion leagues. “Wish to Benefit will be his father, and Listening to the Noble will be this victor’s mother.

source: སྲས་པོ་དེས་པ་གཟུགས་བཟང་རིམ་གྲོ་པ། །
en: Gentle will be his son and Excellent Form his attendant.

source: བསོད་ནམས་འགྲོས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Mode of Merit will be the scholar

source: ཀུན་དུ་སྒྲོན་མ་ཞེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And Universal Lamp the one of miracles.

source: འདུས་པ་ལན་གྲངས་བདུན་ཅུ་ཀུན་ལ་ཡང་། །ཐམས་ཅད་རྒྱགས་དང་དྲེགས་འགྲོས་རབ་ཞི་བ། །བྱེ་བ་ཕྲག་ནི་ཁྲི་ཕྲག་བཅུ་བཅུ་ཡོད། །
en: “There will be seventy consecutive congregations, Each of them gathering one trillion Who have all pacified arrogance and haughtiness.

source: དམ་ཆོས་ལོ་གྲངས་བྱེ་བའི་བར་དུ་གནས། །
en: “And the sacred Dharma will remain for ten million years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་བཟང་པོ་གྲངས་ནི་བདུན་འབུམ་སྟེ། །བཀོད་པ་ཐམས་ཅད་རིན་ཆེན་བརྒྱ་སྙེད་ཡིན། །
en: The relics of this victor will be abundant. The fine stūpas will number seven hundred thousand And be decorated with arrays of hundreds of jewels.
